// func: 单韵母转片假名
export function fin_conv(fin) {
    const fin_map = {
        '': '', 'a': 'ア', 'o': 'オ', 'e': 'ウ', 'i': 'イ', 'u': 'ウ', 'v': 'ウ',
        'n': 'ン', 'ng': 'ン'
    };
    return fin_map[fin];
}

// func: 双韵母转片假名
export function fin2_conv(fin) {
    const fin_map = {
        '': '', 'a': 'ア', 'o': 'オ', 'e': 'ウ', 'i': 'イ', 'u': 'ウ', 'v': 'ウ',
        'ai': 'アイ', 'ei': 'エイ', 'ui': 'ウイ', 'ao': 'アオ', 'ou': 'オウ', 
        'iu': 'イウ', 'ie': 'イエ', 've': 'ウエ', 'an': 'アン', 'en': 'エン', 
        'in': 'イン', 'un': 'ウン', 'vn': 'ウン', 'ang': 'アン', 'eng': 'エン', 
        'ing': 'イン', 'ong': 'オン',
    };
    return fin_map[fin];
}

// func: 声母与一个韵母转片假名
export function fin_ini_conv(ini, fin, tail) {
    switch (fin) {
        case 'a':
            const fin_map_a = {
                '': 'ア', 'b': 'バ', 'p': 'パ', 'm': 'マ', 'f': 'ファ', 'd': 'ダ',
                't': 'タ', 'n': 'ナ', 'l': 'ラ', 'g': 'ガ', 'k': 'カ', 'h': 'ハ',
                'j': 'ジャ', 'q': 'チャ', 'x': 'シャ', 'zh': 'ジャ', 'ch': 'チャ',
                'sh': 'シャ', 'r': 'ラ', 'z': 'ザ', 'c': 'ツァ', 's': 'サ',
                'y': 'ヤ', 'w': 'ワ'
            };
            return fin_map_a[ini];
        case 'o':
            const fin_map_o = {
                '': 'オ', 'b': 'ボ', 'p': 'ポ', 'm': 'モ', 'f': 'フォ', 'd': 'ド',
                't': 'ト', 'n': 'ノ', 'l': 'ロ', 'g': 'ゴ', 'k': 'コ', 'h': 'ホ',
                'j': 'ジョ', 'q': 'チョ', 'x': 'ショ', 'zh': 'ジョ', 'ch': 'チョ',
                'sh': 'ショ', 'r': 'ロ', 'z': 'ゾ', 'c': 'ツォ', 's': 'ソ',
                'y': 'ヨ', 'w': 'ヲ'
            };
            return fin_map_o[ini];
        case 'e':
            if (!tail) {
                const fin_map_e = {
                    '': 'ウ', 'b': 'ブ', 'p': 'プ', 'm': 'ム', 'f': 'フ', 'd': 'ド',
                    't': 'ツ', 'n': 'ヌ', 'l': 'ル', 'g': 'グ', 'k': 'ク', 'h': 'フ',
                    'j': 'ジュ', 'q': 'チュ', 'x': 'シュ', 'zh': 'ジュ', 'ch': 'チュ',
                    'sh': 'シュ', 'r': 'ル', 'z': 'ズ', 'c': 'ツ', 's': 'ス',
                    'y': 'イェ', 'w': 'ウ'
                };
                return fin_map_e[ini];
            } else {
                const fin_map_e = {
                    '': 'エ', 'b': 'ベ', 'p': 'ペ', 'm': 'メ', 'f': 'フェ', 'd': 'デ',
                    't': 'テ', 'n': 'ネ', 'l': 'レ', 'g': 'ゲ', 'k': 'ケ', 'h': 'ヘ',
                    'j': 'ジェ', 'q': 'チェ', 'x': 'シェ', 'zh': 'ジェ', 'ch': 'チェ',
                    'sh': 'シェ', 'r': 'レ', 'z': 'ゼ', 'c': 'ツェ', 's': 'セ',
                    'y': 'イェ', 'w': 'ウェ'
                };
                return fin_map_e[ini];
            }
        case 'i':
            const fin_map_i = {
                '': 'イ', 'b': 'ビ', 'p': 'ピ', 'm': 'ミ', 'f': 'フィ', 'd': 'ディ',
                't': 'ティ', 'n': 'ニ', 'l': 'リ', 'g': 'ギ', 'k': 'キ', 'h': 'ヒ',
                'j': 'ジ', 'q': 'チ', 'x': 'シ', 'zh': 'ジ', 'ch': 'チ', 'sh': 'シ',
                'r': 'リ', 'z': 'ズ', 'c': 'ツ', 's': 'ス', 'y': 'イ', 'w': 'ウィ'
            };
            return fin_map_i[ini];
        case 'u':
            const fin_map_u = {
                '': 'ウ', 'b': 'ブ', 'p': 'プ', 'm': 'ム', 'f': 'フ', 'd': 'ド',
                't': 'ツ', 'n': 'ヌ', 'l': 'ル', 'g': 'グ', 'k': 'ク', 'h': 'フ',
                'j': 'ジュ', 'q': 'チュ', 'x': 'シュ', 'zh': 'ジュ', 'ch': 'チュ',
                'sh': 'シュ', 'r': 'ル', 'z': 'ズ', 'c': 'ツ', 's': 'ス',
                'y': 'ユ', 'w': 'ウ'
            };
            return fin_map_u[ini];
        case 'v':
            const fin_map_v = {
                '': 'ウ', 'b': 'ブ', 'p': 'プ', 'm': 'ム', 'f': 'フ', 'd': 'ド',
                't': 'ツ', 'n': 'ヌ', 'l': 'ル', 'g': 'グ', 'k': 'ク', 'h': 'フ',
                'j': 'ジュ', 'q': 'チュ', 'x': 'シュ', 'zh': 'ジュ', 'ch': 'チュ',
                'sh': 'シュ', 'r': 'ル', 'z': 'ズ', 'c': 'ツ', 's': 'ス',
                'y': 'ヴ', 'w': 'ウ'
            };
            return fin_map_v[ini];
        default:
            console.log('Error: that is impossible!');
            return ini;
    }
}

